# ###
# task 18

# X = брой шестици при 10 хвърляния на зар
# X ~ Bi(n=10, p=1/6)

# P(X = 2)
dbinom(2, 10, 1/6)
choose(10, 2)*(1/6)^2*(5/6)^8

# P(X <= 2)
pbinom(2, 10, 1/6)
dbinom(0, 10, 1/6) + dbinom(1, 10, 1/6) + dbinom(2, 10, 1/6)

# P(X >= 2) = 1 - P(X <= 1)
1 - pbinom(1, 10, 1/6)

# P(3 <= X <= 8) = P(X <= 8) - P(X <= 2) 
pbinom(8, 10, 1/6) - pbinom(2, 10, 1/6)
sum( dbinom(3:8, 10, 1/6) )

# task 19

# X = брой хвърляния до падане на шестица (вкл.)
# X ~ Ge(p=1/6)

# P(X <= 10)
pgeom(10 - 1, 1/6)

# P(X >= 6) = 1 - P(X <= 5)
1 - pgeom(5 - 1, 1/6)

# ###
# task 20

# X = брой хвърляния докато се паднат общо 3 шестици
# X ~ NB(r=3, p=1/6)

# P(X <= 20)
pnbinom(20 - 3, 3, 1/6)

# ###
# task 21

# X = брой нови батерии от избраните
# От 2 избрани батерии, новите може да са 0, 1 или 2.

# Фенерчето ще заработи ако изберем 2 нови батерии, 
# няма да заработи ако изберем по-малко от 2 нови.
# P(избираме по-малко от 2 нови)  =  P(X = 0) + P(X = 1) 
#  =  1 - P(X = 2)

# P(X = 0) + P(X = 1)
dhyper(0, 5, 3, 2) + dhyper(1, 5, 3, 2)

# 1 - P(X = 2)
1 - dhyper(2, 5, 3, 2)
1 - choose(5, 2) * choose(3, 0)/choose(8, 2)

# ###
# task 22

# X = брой грешки на 1500 думи
# X ~ Bi(n=1500, p=1/500)

n <- 1500
p <- 1/500

# P(X <= 2)
pbinom(2, n, p)
ppois(2, n * p)

# P(1 <= X <= 3) = P(X=1) + P(X=2) + P(X=3)
sum( dbinom(1:3, n, p) )

# P(1 <= X <= 3) = P(X <= 3) - P(X <= 0)
pbinom(3, n, p) - pbinom(0, n, p)
ppois(3, n * p) - ppois(0, n * p)

# ###
# task 23

# X = брой верни отговори, дадени от Иван на теста
# X ~ Bi(n=10, p=1/4)

# P(X >= 5) = 1 - P(X <= 4)
1 - pbinom(4, 10, 1/4)

# ###
# task 24

# X = брой пътници, които идват навреме
# X ~ Bi(n=143, p=0.92)

# а)
# P(X <= 138)
pbinom(138, 143, 0.92)

# б)
# P(X = 137)
dbinom(137, 143, 0.92)

# ###
# task 25

# а)
# X = брой проверени батерии до откриване на първата дефектна (вкл.)
# X ~ Ge(p=0.03)

# P(X <= 10)
pgeom(10 - 1, 0.03)

# б)
# X = брой дефектни батерии измежду 50 проверени
# X ~ Bi(n=50, p=0.03)

# P(X >= 2) = 1 - P(X <= 1)
1 - pbinom(1, 50, 0.03)

###
# task 26

# X = брой дефектни батерии измежду 50 проверени от общо 100

# P(X >= 2) = 1 - P(X <= 1)
1 - phyper(1, 3, 97, 50)



